[
  "What dish from your childhood makes you feel nostalgic?",
  "What do you think my go to karaoke song is?",
  "What compliment do you think I hear the most?",
  "What’s the most creative thing you can cook?",
  "If you were to buy me a present, knowing nothing about me other than what I look like, what would it be?",
  "What was your favorite part about our last date?",
  "What is your favorite memory of us this month?",
  "What do you like the most about me physically?",
  "What would your younger self not believe about your life today?",
  "What is something you wouldn't want to change about yourself?",
  "In what ways can we keep our relationship exciting?",
  "What’s a small gesture that makes you feel loved?",
  "How would you describe me to someone else?",
  "How does someone earn your vulnerability?",
  "What are the top five qualities you admire about me?",
  "What recent experience made you feel closer to me?",
  "What do you think my defining characteristic is?",
  "What do you think our most important similarity is?",
  "Which part of your life changed the most since we've met?",
  "How can I support you during a stressful work period?",
  "Can you describe in detail the moment you knew you were attracted to me?",
  "What does my touch feel like?",
  "How do you think we balance each other out?",
  "What do you think my superpower is?",
  "How can I make you more confident in our future together?",
  "How would you describe me to another person?",
  "What was the first thing you told your friends about me?",
  "What's your favorite inside joke or silly memory we've created together?",
  "What parts of yourself do you see in me?",
  "What immediately attracted you to me? What attracted you more over time?",
  "In what ways am I good for your mental health?",
  "What was your favorite date we’ve ever had? What made it your favorite?",
  "How do you feel right now?",
  "Give each other a warm fluffy hug",
  "What recent experience made you feel closer to me?",
  "Is there a part of you you'd wish I understood more?",
  "What can we create together?",
  "Take a selfie together :)",
  "Share something you're most grateful for in this current moment.",
  "What's one goofy, little thing about me that never fails to make you smile?",
  "Where are three places you’ve thought about having sex other than our bed?",
  "Have you picked up on any red or yellow flags that you'd like to share with me so that I address them?",
  "What's something that you like that you want me to get into?",
  "Do you feel like we're on the same page about our future goals?",
  "How do you want to change the world?",
  "How do you describe the feeling of being in love?",
  "How do you want to be loved?",
  "What color do you think of when you think of yourself?",
  "What am I the most closed off about?",
  "What type of love do you want to give?",
  "What makes me different from everyone else you've met?",
  "What do you want to try with me that we haven’t done together yet?",
  "What do I do that turns you on the most?",
  "What do you think I worry about the most?",
  "Why do you think we work?",
  "When do you feel the most connected to me?",
  "What would a day of completely spoiling me be like?",
  "Whats your favorite sexual memory of us?",
  "What answer of mine made you light up?",
  "What has this conversation taught you about yourself?"
]
