[
  "Just by looking at me, what do you think I do for a living?",
  "What's been the highlight of your week so far?",
  "What do you think my drink of choice is?",
  "What is your love language and how do you like to express affection?",
  "What's your favorite type of cuisine? Where's your favorite thing about it?",
  "What is one thing that you're a complete nerd about?",
  "What is your biggest green flag?",
  "Create a secret handshake 😎",
  "If a museum about you had a gift shop, what would be the souvenirs?",
  "What was the first thing you noticed about me when we met in person?",
  "If someone were to say 'I'im pulling a [their name]', what would that mean?",
  "Just by looking at me, what do you think are my hobbies?",
  "What's a topic you wish people talked more about?",
  "What kind of a date would get you really excited?",
  "What’s something someone could say or do that would make you instantly swoon?",
  "What is something that you would love to be a master at?",
  "Do a game of thumb war!",
  "Would you prefer to have a partner that feels like home or adventure? Why?",
  "What would be the worst thing for the government to make illegal?",
  "What's your favorite activity to do together with someone?",
  "What sort of a flirt are you?",
  "How would you describe a bad kiss?",
  "What's your attachment style? How do you feel it has affected your present and past relationships?",
  "What was your first impression of me? How did you think I was like?",
  "What's your favorite way of contributing to community?",
  "What attracts you to people?",
  "What about life makes you excited?",
  "Give each other a hug. Not the crappy kind. A warm fluffy hug.",
  "What about me intrigued you besides my physical appearance?",
  "What was the worst date you've ever been on and why?",
  "Take a selfie together :)",
  "What habits or patterns in your life are you trying to break?",
  "What’s your most uncommon interest?",
  "What activity do you love so much that you lose track of time?",
  "What are some green flags about me that you noticed that you're very excited about?",
  "If your life was a movie, what would the audience be screaming at the screen telling you do right now?",
  "What dating advice would you give to your younger self?",
  "What was the best first date you’ve ever had?",
  "What does love look like to you?",
  "What do you consider is your biggest accomplishment?",
  "What is something new you've learned about yourself recently?",
  "Do you have any goals you'd like to accomplish this year?",
  "What are you feeling a lot of lately?",
  "What makes you who you are?",
  "What is it that you like about me the most?",
  "Look through each other's social media and pick your favorite photo",
  "What do you find most attractive about me that isn't physical?",
  "How would you describe our date in one word",
  "What song should I listen to on my way home?"
]
