[
  "What was the first thing you noticed about me when we met in person?",
  "Just by looking at me, what do you think I do for a living?",
  "What's been the highlight of your week so far?",
  "If you were at a grocery store and you suddenly disappeared for 10 minutes , where would u be?",
  "What is your love language and how do you like to express affection?",
  "What made you interested in going on a date with me?",
  "What's your favorite type of cuisine? Where's your favorite thing about it?",
  "What is one thing that you're a complete nerd about?",
  "Create a secret handshake 😎",
  "Tell me about your coolest friend.",
  "Whats your type? Describe in detail.",
  "If a museum about you had a gift shop, what would the souvenirs be?",
  "What’s your most uncommon interest?",
  "What was your last impulse buy?",
  "If someone were to say 'I'im pulling a [their name]', what would that mean?",
  "What's a topic you wish people talked more about?",
  "What kind of a date would get you really excited?",
  "What is your biggest green flag?",
  "What’s something someone could say or do that would make you instantly swoon?",
  "If we were to have a debate right now, what topics would you absolutely crush me in?",
  "Do a game of thumb war!",
  "What do you find most attractive about me that isn't physical?",
  "How did your last relationship end and what did it teach you about yourself?",
  "What would be the worst thing for the government to make illegal?",
  "When you have a crush on someone, whats one of the first things you notice about them?",
  "What sort of a flirt are you?",
  "How would you describe a good kiss?",
  "What's your attachment style? How do you feel it has affected your present and past relationships?",
  "What's the most attractive thing about my personality?",
  "What's your favorite way of contributing to community?",
  "Give each other a warm fluffy hug.",
  "What are some green flags about me that you noticed that you're very excited about?",
  "What about life makes you excited?",
  "What was the worst date you've ever been on and why?",
  "Take a selfie together :)",
  "Whats something you’re proud of that most people don’t notice?",
  "If you could tell me one thing you’ve learned in your life from your mistakes, what would that be?",
  "What was the best first date you’ve ever had?",
  "What does love look like to you?",
  "What do you consider is your biggest accomplishment?",
  "What is something new you've learned about yourself recently?",
  "Do you have any goals you'd like to accomplish this year?",
  "What are you feeling a lot of lately?",
  "What makes you who you are?",
  "What is it that you like about me the most?",
  "Look through each other's social media and pick your favorite photo",
  "How would you describe our date in one word",
  "What song should I listen to on my way home?"
]
