[
  "Just by looking at me, what do you think I do for a living?",
  "What do you think my drink of choice is?",
  "What is your love language and how do you like to express affection?",
  "What's your favorite type of cuisine?",
  "What is one thing that you're a complete nerd about?",
  "If a magical witch was trying to summon you, what 3 things would she put in the summoning circle?",
  "If you were in a position of power at a company, what kind of boss would you be?",
  "What's your favorite activity to do together with someone?",
  "What's your attachment style? How do you feel it has affected your present and past relationships?",
  "What is something that you're working on right now that you're super excited?",
  "What was the first thing you noticed about me when we met in person?",
  "What's your favorite way of contributing to community?",
  "What's a new hobby you want to start this year?",
  "What attracts you to people?",
  "What do you think my type is? Describe in detail.",
  "What about me intrigued you besides my physical appearance?",
  "What was the worst date you've ever been on and why?",
  "How do you personally define living a 'good life'?",
  "What’s something you’re currently working on improving about yourself?",
  "What do you find most attractive in a potential partner beyond physical appearance?",
  "Create a secret handshake 😎",
  "What’s your most uncommon interest?",
  "What activity do you love so much that you lose track of time?",
  "What are some green flags about me that you noticed that you're very excited about?",
  "What dating advice would you give to your younger self?",
  "What do you think leads people to have chemistry?",
  "What was the best first date you’ve ever had?",
  "What's your worst habit?",
  "What does love look like to you?",
  "Give each other a hug. Not the crappy kind. A warm fluffy hug.",
  "What do you consider is your biggest accomplishment?",
  "What is something new you've learned about yourself recently?",
  "Take a selfie together :)",
  "What are you overthinking right now?",
  "What's the hardest part about dating you?",
  "Do you have any goals you'd like to accomplish this year?",
  "What are you feeling a lot of lately?",
  "What is something that scares you? And why?",
  "What makes you who you are?",
  "What is it that you like about me the most?",
  "What are your top 2 relationship deal breakers?",
  "Look through each other's social media and pick your favorite photo",
  "What do you find most attractive about me that isn't physical?",
  "What mannerisms of mine stood out the most to you if any?",
  "How would you describe our date in one word",
  "What song should I listen to on my way home?"
]
