[
  "What’s the weirdest thing you believed as a kid?",
  "If we had a theme song, what would it be?",
  "What food would you marry if you could?",
  "What would our couple nickname be?",
  "What’s one thing I do that makes you laugh even when you don’t want to?",
  "If we had a time machine, where would we mess things up first?",
  "What would you do if you fond a tiny dragon in your pocket right now?",
  "What would office gossip be about you?",
  "Whats the cheesiest pickup line you like?",
  "If we had to enter a talent show together, what ridiculous act would we do?",
  "Which animal do you think is our spirit animal couple hybrid?",
  "If we were super villains, what dumb crime would we commit?",
  "Which fictional world would we totally get kicked out of?",
  "If you had to cook me something using only vending machine snacks, what would you make?",
  "If we had a fan club, what would they call themselves?",
  "What would be our special move in a couples’ video game?",
  "Create a signature dance move together",
  "If you could instantly give me a useless superpower, what would it be?",
  "If we were action movie heroes, what would be our cheesy one-liner before saving the day?",
  "If we accidentally started a cult, what would its main rule be?",
  "Which mythical creature would totally crash our date nights?",
  "Enact a funny pose as if we were frozen as statues",
  "What would be the most ridiculous reason for us to get banned from somewhere?",
  "Do a fake commercial together for an imaginary product.",
  "Create a “royal wave” we would use if we were famous monarchs.",
  "Do your best impression of two penguins walking together.",
  "Take turns making up ridiculous “news reports” about the other person.",
  "Act out an awkward first meeting between two secret agents.",
  "If i had a warning label, what would it say?",
  "If you lost me in a shopping mall, which shop would you look in first?",
  "What’s something I do that is so “me”?",
  "If you found a pink sheep in Minecraft, what would you name them?",
  "If we met during the Ancient Roman Empire, what would our first date be?"
]
