[
  "What's a piece of advice you'd give to someone exploring their gender or sexual identity?",
  "Share a piece of advice you'd give to someone who is considering coming out.",
  "How do you bring LGBTQ+ visibility into your daily life?",
  "What's a skill or hobby you're passionate about",
  "How do you celebrate your queer identity in your style or fashion choices?",
  "How do you celebrate your queer identity in your daily life?",
  "How do you handle situations where you encounter misconceptions or stereotypes about the LGBTQ+ community?",
  "Share your favorite queer slang or expression and its meaning to you.",
  "What was your coming-out experience like, and how did it shape your relationship with your family?",
  "What's a memorable moment from a queer-focused event you attended?",
  "Share a positive coming-out experience that you've had.",
  "How do you approach dating within the queer community?",
  "What's your favorite LGBTQ+ anthem or song that makes you feel empowered?",
  "How do you bring a touch of queerness into your home decoration?",
  "Share a funny or heartwarming story from your experiences within the queer community.",
  "How do you approach creating a safe and inclusive space for others in your life?",
  "Discuss a project or initiative you're involved in that supports the LGBTQ+ community.",
  "What's a book, podcast, or resource you'd recommend to someone looking to learn more about queer history?",
  "How do you navigate and find support in the queer community during challenging times?",
  "Share a piece of LGBTQ+ media (book, movie, TV show, etc.) that had a significant impact on you.",
  "What's your go-to self-care activity when you need a boost?",
  "How do you celebrate Pride, and what does it mean to you?",
  "How do you balance and celebrate the intersectionality of your identity?",
  "Share a goal or dream you have for the broader LGBTQ+ community.",
  "What's a personal achievement related to your LGBTQ+ identity that you're proud of?",
  "What's a piece of advice you'd give to your younger self about embracing your identity?",
  "Discuss a moment when you felt truly seen and accepted within the LGBTQ+ community.",
  "How do you balance being an ally to other marginalized communities within the queer spectrum?",
  "Share a piece of advice for someone wanting to learn more about and engage with queer cultural history."
]
