[
  "How would you describe your personality? Are you the goofy life of the party kind of person or are you a serious and focused objective seeker?",
  "What kind of cool stuff do you do in your life?",
  "What’s your favorite book or show?",
  "What's something you're really passionate about?",
  "What’s the coolest thing you learned this week?",
  "You’re invited onto Shark Tank or Dragon’s Den. What do you pitch?",
  "How seriously do you take horoscopes?",
  "Is there a project you've started, but haven't finished?",
  "If you could teach every guy on the planet a lesson about women, what would it be?",
  "What stimulates your creativity?",
  "What’s the best thing about your job?",
  "What’s the most rebellious thing you did as a teenager?",
  "What’s the darkest type of humor you find hilarious?",
  "What’s your most embarrassing hobby?",
  "What’s the weirdest dream you’ve ever had?",
  "What do you value in relationships?",
  "Do you have any personal milestones?",
  "What about me intrigues you?",
  "Have you been the kind of friend you want as a friend?",
  "What do people misunderstand about you?",
  "What’s something you’ve always wanted to do but haven’t yet?",
  "What’s the most embarrassing way you’ve been injured?",
  "What event has made you a stronger person?",
  "If you had to pick, which fictional character best represents you?",
  "What leaves you at ease / makes you feel peace?",
  "What about people do you hate most?",
  "Whats the best trip you’ve ever taken?",
  "Whats one thing you would change about the world?",
  "If we learn from our mistakes, why are we always so afraid to make a mistake?",
  "What do you look out for in a friend / partner?",
  "What should I know about you that I would never think to ask?",
  "What does barely anyone know about you, that you wish more people would?",
  "What's something you wish you were really good at?",
  "What’s the most frightening experience you’ve ever had?",
  "What's something you love about your hometown?",
  "Did you have a time in life when everything changed? "
]
