[
  "What catches your eye in a person's personality?",
  "What's your favorite part of your body?",
  "Have you ever done the BDSM test? Let's see it!",
  "What's your favorite part of foreplay?",
  "Give each other a gentle hand massage, focusing on the fingers and palms. Pay attention to how the other person responds to your touch.",
  "How do you prefer for sex to be initiated?",
  "What does being good in bed mean to you?",
  "What non-sexual forms of physical touch turns you on?",
  "Create a cozy space with blankets and pillows and cuddle together while talking.",
  "What gives you pleasure?",
  "Can you describe in detail the moment you knew you were attracted to me?",
  "Snuggle up and enjoy the warmth of each others body in a cosy and soft cuddle",
  "What does being good at kissing mean to you? What does your ideal kiss look like?",
  "If you could take a course to learn about any sexual topic, what would it be on?",
  "Whats something that someone did to you in bed that you still think about sometimes?",
  "What are your most sensitive erogenous zones that don't always get attention",
  "What is your favorite form of sensual or erotic art, and why does it captivate you?",
  "Sit facing each other and gently caress each other's hair, face, and arms. Take note of the physical traits and small mannerisms that stand out.",
  "What's the most attractive thing about my personality?",
  "What's one thing you've learned about your sexual preferences through past relationships?",
  "Would you like to see your partner having sex with someone else? What do you feel like that experience would be like?",
  "What sexual fantasy would you like to experience one day?",
  "What kind of aftercare makes you feel loved and cherished?",
  "Describe something that turns you on, which you haven't shared with me",
  "Kiss my neck the way you would want to be kissed",
  "What are your thoughts on dirty talking? Do you like being insulted in bed? ",
  "What is the sexiest quality or feature you find irresistible in a partner?",
  "If you could enact a scene from an erotic novel, movie or video, what would it be?",
  "Have you ever explored the world of tantric or sacred sexuality? If not, would you be open to it and what parts of it spark your curiosity?",
  "If you could design your own erotic party or event, what would it look like and what activities would take place?",
  "What's the most intense or mind-blowing orgasmic experience you've ever had?",
  "Have you ever experimented with aphrodisiacs or substances to enhance sexual experiences?",
  "What's your opinion on engaging in sexual encounters that involve consensual non-consent or role-playing scenarios like kidnapping or interrogation?",
  "Show me the way you like to be choked."
]
