[
  "Do you have a profile on a dating app? Let's see it!",
  "What catches your eye in a person's dating app profile?",
  "Would you like to pose in a nude drawing class?",
  "What's your favorite part of your body?",
  "Would you like to be part of a throuple? (relationship with 3 people)",
  "Would you rather be caught having sex or catch your in-laws?",
  "What is your opinion on exploring multiple partners or consensual non-monogamy?",
  "How long should foreplay last?",
  "Describe in 5 words your last performance in bed.",
  "Have you ever faked an orgasm? Why?",
  "What are your most erogenous zones?",
  "Cite two qualities that you think are indispensable in a sexual partner.",
  "Have you ever done the BDSM test? Let's see it!",
  "What is your favorite form of sensual or erotic art, and why does it captivate you?",
  "How many people have you had sex with since the beginning of the year?",
  "What's your take on incorporating bondage or other forms of BDSM into intimate moments?",
  "Would you like to see your partner having sex with someone else?",
  "What sexual fantasy would you like to experience one day?",
  "Have you ever been given a greek kiss? How did you feel about it?",
  "Do you like being insulted in bed? What are your thoughts on dirty talking?",
  "What is the sexiest quality or feature you find irresistible in a partner?",
  "If you could enact a scene from an erotic novel or movie, which one would you choose?",
  "Have you ever explored the world of tantric or sacred sexuality? If not, would you be open to it?",
  "If you could design your own erotic party or event, what would it look like and what activities would take place?",
  "What's the most intense or mind-blowing orgasmic experience you've ever had?",
  "Have you ever experimented with aphrodisiacs or substances to enhance sexual experiences?",
  "What's your opinion on engaging in sexual encounters that involve consensual non-consent or role-playing scenarios like kidnapping or interrogation?"
]
